import customtkinter as ctk

class App(ctk.CTk):
    def __init__(self):
        super().__init__()

        self.geometry("400x240")
        self.title("Привет")
        self.resizable(False, False)

        self.RegionList = [
            "Республика Алтай", "Республика Башкортостан", "Республика Бурятия",
            "Карачаево-Черкесская Республика", "Республика Карелия", "Республика Коми",
            "Республика Марий Эл", "Республика Мордовия", "Республика Саха (Якутия)",
            "Республика Татарстан", "Республика Тыва", "Республика Хакасия",
            "Удмуртская Республика", "Чувашская Республика", "Алтайский край",
            "Забайкальский край", "Камчатский край", "Краснодарский край",
            "Красноярский край", "Пермский край", "Приморский край", "Хабаровский край",
            "Амурская область", "Архангельская область", "Белгородская область",
            "Брянская область", "Владимирская область", "Волгоградская область",
            "Вологодская область", "Воронежская область", "Ивановская область",
            "Иркутская область", "Калужская область", "Кемеровская область",
            "Кировская область", "Костромская область", "Курганская область",
            "Курская область", "Ленинградская область", "Липецкая область",
            "Магаданская область", "Московская область", "Мурманская область",
            "Нижегородская область", "Новгородская область", "Новосибирская область",
            "Омская область", "Оренбургская область", "Орловская область",
            "Пензенская область", "Псковская область", "Ростовская область",
            "Рязанская область", "Самарская область", "Саратовская область",
            "Сахалинская область", "Свердловская область", "Смоленская область",
            "Тамбовская область", "Тверская область", "Томская область",
            "Тульская область", "Тюменская область", "Ульяновская область",
            "Челябинская область", "Ярославская область", "Москва",
            "Санкт-Петербург", "Еврейская автономная область", "Ненецкий автономный округ",
            "Ханты-Мансийский автономный округ - Югра", "Чукотский автономный округ",
            "Ямало-Ненецкий автономный округ"
        ]

        # Создаем начальные элементы
        self.create_welcome_widgets()

    def create_welcome_widgets(self):
        # Создание стартовых виджетов
        self.text_welcome = ctk.CTkLabel(self, text='Привет. Введи свой регион:', text_color='gray')
        self.region_select = ctk.CTkOptionMenu(self, values=self.RegionList)
        self.region_done = ctk.CTkButton(self, text='Готово', command=self.on_done)

        self.text_welcome.place(relx=0.5, rely=0.35, anchor="center")
        self.region_select.place(relx=0.5, rely=0.45, anchor="center")
        self.region_done.place(relx=0.5, rely=0.6, anchor="center")

    def on_done(self):
        # Удаление текущих виджетов
        self.clear_widgets()

        self.text_confirmed = ctk.CTkLabel(self, text="Отлично, давайте дальше.")

    def clear_widgets(self):
        # Удаление всех виджетов с экрана
        for widget in self.winfo_children():
            widget.place_forget()

    # Запуск приложения
if __name__ == "__main__":
    app = App()
    app.mainloop()